scripts/exp1/redis-sls-100-04.txt
====== PING_INLINE ======
  100000 requests completed in 3.08 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.03% <= 0.4 milliseconds
0.32% <= 0.5 milliseconds
4.97% <= 0.6 milliseconds
39.28% <= 0.7 milliseconds
83.28% <= 0.8 milliseconds
96.32% <= 0.9 milliseconds
97.74% <= 1.0 milliseconds
97.93% <= 1.1 milliseconds
97.99% <= 1.2 milliseconds
98.04% <= 1.3 milliseconds
98.07% <= 1.4 milliseconds
98.10% <= 1.5 milliseconds
98.13% <= 1.6 milliseconds
98.16% <= 1.7 milliseconds
98.19% <= 1.8 milliseconds
98.22% <= 1.9 milliseconds
98.25% <= 2.0 milliseconds
98.28% <= 2.1 milliseconds
98.28% <= 2 milliseconds
98.47% <= 3 milliseconds
98.48% <= 4 milliseconds
98.53% <= 5 milliseconds
98.60% <= 6 milliseconds
98.68% <= 7 milliseconds
98.78% <= 8 milliseconds
98.80% <= 10 milliseconds
98.86% <= 11 milliseconds
99.06% <= 12 milliseconds
99.19% <= 13 milliseconds
99.33% <= 14 milliseconds
99.51% <= 15 milliseconds
99.60% <= 16 milliseconds
99.60% <= 21 milliseconds
99.73% <= 22 milliseconds
99.75% <= 23 milliseconds
99.89% <= 24 milliseconds
100.00% <= 24 milliseconds
32467.53 requests per second

====== PING_BULK ======
  100000 requests completed in 3.11 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.74% <= 1 milliseconds
97.82% <= 2 milliseconds
98.51% <= 3 milliseconds
98.66% <= 4 milliseconds
98.74% <= 5 milliseconds
98.80% <= 6 milliseconds
98.80% <= 10 milliseconds
98.81% <= 11 milliseconds
99.04% <= 12 milliseconds
99.19% <= 13 milliseconds
99.26% <= 14 milliseconds
99.39% <= 15 milliseconds
99.40% <= 20 milliseconds
99.41% <= 21 milliseconds
99.89% <= 22 milliseconds
99.97% <= 23 milliseconds
100.00% <= 23 milliseconds
32133.68 requests per second

====== SET ======
  100000 requests completed in 3.06 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.70% <= 1 milliseconds
97.90% <= 2 milliseconds
98.62% <= 3 milliseconds
98.84% <= 4 milliseconds
98.89% <= 5 milliseconds
98.95% <= 11 milliseconds
99.22% <= 12 milliseconds
99.35% <= 13 milliseconds
99.39% <= 14 milliseconds
99.51% <= 15 milliseconds
99.55% <= 20 milliseconds
99.55% <= 21 milliseconds
99.93% <= 22 milliseconds
99.99% <= 23 milliseconds
100.00% <= 23 milliseconds
32733.22 requests per second

====== GET ======
  100000 requests completed in 3.06 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.89% <= 1 milliseconds
97.95% <= 2 milliseconds
98.51% <= 3 milliseconds
98.59% <= 4 milliseconds
98.80% <= 5 milliseconds
98.80% <= 11 milliseconds
99.14% <= 12 milliseconds
99.38% <= 13 milliseconds
99.47% <= 14 milliseconds
99.51% <= 15 milliseconds
99.60% <= 16 milliseconds
99.60% <= 21 milliseconds
99.93% <= 22 milliseconds
100.00% <= 22 milliseconds
32647.73 requests per second

====== INCR ======
  100000 requests completed in 3.11 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

95.86% <= 1 milliseconds
97.76% <= 2 milliseconds
98.55% <= 3 milliseconds
98.71% <= 4 milliseconds
98.82% <= 5 milliseconds
98.85% <= 7 milliseconds
98.85% <= 10 milliseconds
98.90% <= 11 milliseconds
99.01% <= 12 milliseconds
99.12% <= 13 milliseconds
99.26% <= 14 milliseconds
99.37% <= 15 milliseconds
99.43% <= 16 milliseconds
99.45% <= 20 milliseconds
99.45% <= 21 milliseconds
99.89% <= 22 milliseconds
100.00% <= 22 milliseconds
32113.04 requests per second

====== LPUSH ======
  100000 requests completed in 2.95 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.48% <= 1 milliseconds
97.74% <= 2 milliseconds
98.58% <= 3 milliseconds
98.70% <= 4 milliseconds
98.86% <= 5 milliseconds
99.07% <= 6 milliseconds
99.10% <= 8 milliseconds
99.14% <= 9 milliseconds
99.25% <= 10 milliseconds
99.25% <= 11 milliseconds
99.53% <= 12 milliseconds
99.73% <= 13 milliseconds
99.79% <= 14 milliseconds
99.82% <= 15 milliseconds
99.85% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 22 milliseconds
33898.30 requests per second

====== RPUSH ======
  100000 requests completed in 3.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

95.37% <= 1 milliseconds
97.25% <= 2 milliseconds
98.39% <= 3 milliseconds
98.49% <= 4 milliseconds
98.59% <= 5 milliseconds
98.68% <= 6 milliseconds
98.74% <= 7 milliseconds
98.79% <= 8 milliseconds
98.86% <= 9 milliseconds
98.92% <= 10 milliseconds
98.95% <= 11 milliseconds
99.04% <= 12 milliseconds
99.14% <= 13 milliseconds
99.29% <= 14 milliseconds
99.32% <= 15 milliseconds
99.39% <= 16 milliseconds
99.45% <= 17 milliseconds
99.56% <= 18 milliseconds
99.65% <= 19 milliseconds
99.74% <= 20 milliseconds
99.84% <= 21 milliseconds
99.96% <= 22 milliseconds
100.00% <= 22 milliseconds
32278.89 requests per second

====== LPOP ======
  100000 requests completed in 3.09 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

94.54% <= 1 milliseconds
96.78% <= 2 milliseconds
98.35% <= 3 milliseconds
98.53% <= 4 milliseconds
98.57% <= 5 milliseconds
98.66% <= 6 milliseconds
98.82% <= 7 milliseconds
98.92% <= 8 milliseconds
99.04% <= 9 milliseconds
99.13% <= 10 milliseconds
99.20% <= 11 milliseconds
99.36% <= 12 milliseconds
99.45% <= 13 milliseconds
99.54% <= 14 milliseconds
99.63% <= 15 milliseconds
99.68% <= 16 milliseconds
99.70% <= 17 milliseconds
99.75% <= 18 milliseconds
99.78% <= 19 milliseconds
99.85% <= 21 milliseconds
99.96% <= 22 milliseconds
100.00% <= 22 milliseconds
32393.91 requests per second

====== RPOP ======
  100000 requests completed in 3.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

95.04% <= 1 milliseconds
97.00% <= 2 milliseconds
98.39% <= 3 milliseconds
98.43% <= 4 milliseconds
98.50% <= 5 milliseconds
98.57% <= 6 milliseconds
98.63% <= 7 milliseconds
98.65% <= 8 milliseconds
98.70% <= 9 milliseconds
98.86% <= 10 milliseconds
98.90% <= 11 milliseconds
99.05% <= 12 milliseconds
99.13% <= 13 milliseconds
99.19% <= 14 milliseconds
99.27% <= 15 milliseconds
99.42% <= 16 milliseconds
99.51% <= 17 milliseconds
99.63% <= 18 milliseconds
99.66% <= 19 milliseconds
99.73% <= 20 milliseconds
99.75% <= 21 milliseconds
99.90% <= 22 milliseconds
100.00% <= 22 milliseconds
31816.74 requests per second

====== SADD ======
  100000 requests completed in 3.06 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

95.47% <= 1 milliseconds
97.49% <= 2 milliseconds
98.48% <= 3 milliseconds
98.58% <= 4 milliseconds
98.79% <= 5 milliseconds
98.89% <= 6 milliseconds
99.00% <= 7 milliseconds
99.05% <= 8 milliseconds
99.10% <= 9 milliseconds
99.15% <= 10 milliseconds
99.15% <= 11 milliseconds
99.29% <= 12 milliseconds
99.41% <= 13 milliseconds
99.47% <= 14 milliseconds
99.55% <= 15 milliseconds
99.60% <= 17 milliseconds
99.67% <= 18 milliseconds
99.74% <= 19 milliseconds
99.83% <= 20 milliseconds
99.92% <= 21 milliseconds
100.00% <= 22 milliseconds
100.00% <= 22 milliseconds
32690.42 requests per second

====== HSET ======
  100000 requests completed in 3.01 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.43% <= 1 milliseconds
97.57% <= 2 milliseconds
98.43% <= 3 milliseconds
98.66% <= 4 milliseconds
98.79% <= 5 milliseconds
98.90% <= 6 milliseconds
98.93% <= 7 milliseconds
98.96% <= 8 milliseconds
99.00% <= 10 milliseconds
99.00% <= 11 milliseconds
99.32% <= 12 milliseconds
99.60% <= 14 milliseconds
99.67% <= 15 milliseconds
99.70% <= 16 milliseconds
99.72% <= 17 milliseconds
99.76% <= 18 milliseconds
99.85% <= 21 milliseconds
99.93% <= 22 milliseconds
100.00% <= 22 milliseconds
33233.63 requests per second

====== SPOP ======
  100000 requests completed in 2.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.31% <= 1 milliseconds
97.83% <= 2 milliseconds
98.57% <= 3 milliseconds
98.72% <= 4 milliseconds
98.92% <= 5 milliseconds
99.03% <= 6 milliseconds
99.10% <= 7 milliseconds
99.12% <= 8 milliseconds
99.23% <= 9 milliseconds
99.33% <= 10 milliseconds
99.35% <= 11 milliseconds
99.58% <= 12 milliseconds
99.75% <= 13 milliseconds
99.78% <= 14 milliseconds
99.80% <= 17 milliseconds
99.83% <= 18 milliseconds
99.85% <= 19 milliseconds
99.87% <= 20 milliseconds
99.90% <= 21 milliseconds
99.98% <= 22 milliseconds
100.00% <= 22 milliseconds
33613.45 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 3.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

95.02% <= 1 milliseconds
97.10% <= 2 milliseconds
98.39% <= 3 milliseconds
98.55% <= 4 milliseconds
98.63% <= 5 milliseconds
98.75% <= 6 milliseconds
98.88% <= 7 milliseconds
98.97% <= 8 milliseconds
99.00% <= 10 milliseconds
99.04% <= 11 milliseconds
99.12% <= 12 milliseconds
99.26% <= 13 milliseconds
99.32% <= 14 milliseconds
99.40% <= 15 milliseconds
99.45% <= 16 milliseconds
99.48% <= 17 milliseconds
99.60% <= 18 milliseconds
99.70% <= 19 milliseconds
99.79% <= 20 milliseconds
99.85% <= 21 milliseconds
99.93% <= 22 milliseconds
99.99% <= 23 milliseconds
100.00% <= 23 milliseconds
32258.07 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.94 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

85.28% <= 1 milliseconds
95.61% <= 2 milliseconds
97.61% <= 3 milliseconds
97.91% <= 4 milliseconds
98.04% <= 5 milliseconds
98.16% <= 6 milliseconds
98.21% <= 7 milliseconds
98.26% <= 8 milliseconds
98.32% <= 9 milliseconds
98.41% <= 10 milliseconds
98.49% <= 11 milliseconds
98.65% <= 12 milliseconds
98.83% <= 13 milliseconds
99.01% <= 14 milliseconds
99.10% <= 15 milliseconds
99.15% <= 16 milliseconds
99.27% <= 17 milliseconds
99.39% <= 18 milliseconds
99.54% <= 19 milliseconds
99.64% <= 20 milliseconds
99.74% <= 21 milliseconds
99.83% <= 22 milliseconds
99.97% <= 23 milliseconds
100.00% <= 24 milliseconds
100.00% <= 24 milliseconds
25393.60 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.17% <= 1 milliseconds
95.74% <= 2 milliseconds
96.88% <= 3 milliseconds
97.77% <= 4 milliseconds
98.21% <= 5 milliseconds
98.38% <= 6 milliseconds
98.53% <= 7 milliseconds
98.69% <= 8 milliseconds
98.85% <= 9 milliseconds
99.03% <= 10 milliseconds
99.14% <= 11 milliseconds
99.29% <= 12 milliseconds
99.43% <= 13 milliseconds
99.57% <= 14 milliseconds
99.64% <= 15 milliseconds
99.69% <= 16 milliseconds
99.73% <= 17 milliseconds
99.76% <= 18 milliseconds
99.79% <= 19 milliseconds
99.80% <= 20 milliseconds
99.80% <= 21 milliseconds
99.86% <= 22 milliseconds
99.94% <= 23 milliseconds
99.99% <= 24 milliseconds
100.00% <= 24 milliseconds
17277.12 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.08 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
95.64% <= 2 milliseconds
99.56% <= 3 milliseconds
99.70% <= 4 milliseconds
99.82% <= 5 milliseconds
99.90% <= 6 milliseconds
99.93% <= 7 milliseconds
99.95% <= 8 milliseconds
99.96% <= 9 milliseconds
99.97% <= 10 milliseconds
99.98% <= 11 milliseconds
99.99% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 13 milliseconds
14124.29 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.89 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
62.90% <= 2 milliseconds
99.79% <= 3 milliseconds
99.92% <= 4 milliseconds
99.95% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 7 milliseconds
12680.70 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.93 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

92.97% <= 1 milliseconds
99.83% <= 2 milliseconds
99.99% <= 3 milliseconds
100.00% <= 3 milliseconds
34083.16 requests per second